using BenchmarkDotNet.Attributes;
using TextSummarization.TextRank;

namespace TextSummarization.ConsoleApp;

public class SummarizationBenchmark
{
    public ISummarizer Luhn { get; set; } = new LuhnMethodSummarizer();
    public ISummarizer TextRank { get; set; } = new TextRankSummarizer();
    public ISummarizer LexRank { get; set; } = new LexRankSummarizer();
    public ISummarizer Lsa { get; set; } = new LsaSummarizer();
    
    public string Text = """
                         Кримінальне розслідування направлене на встановлення істини і його остаточна мета – виявлення і кримінальне переслідування винних.
                         
                         Сьогодні, 28 вересня, об'єднана слідча група (JIT) представила перші результати кримінального розслідування причин катастрофи авіалайнера рейсу МН17.
                         
                         17 липня 2014 року у рамках цієї слідчої групи спільно працюють представники Австралії, Бельгії, Малайзії, Нідерландів і України.
                         
                         У прес-центрі Служби безпеки України представили повний текст звіту:
                         
                         Йдеться про велике і складне розслідування. Щоб проілюструвати свої слова, хочу навести кілька даних, які допоможуть вам уявити собі його масштаби:
                         
                         Протягом тривалого періоду часу у розслідуванні, в складі Об'єднаної слідчої групи JIT, брало участь від 100 до 200 слідчих і різного роду експертів. До цього дня, щодня, працюють над справою до ста слідчих, прокурорів і експертів. За минулі два роки найскрупульознішим чином було розслідувано вміст десятків контейнерів, що вміщують тисячі фрагментів та уламків. 1448 з цих фрагментів були внесені до бази даних як речові докази. До більше ніж 20 країн було направлено 60 запитів про правову допомогу, і на багато з них була отримана відповідь. Ми досліджували двадцять різних систем озброєння. Ми зафіксували п'ять мільярдів сторінок Інтернету, зміст яких розглядається на предмет цінності для розслідування. Було проведено ретельне розслідування і фіксація півмільйона відеозйомок і фотографій, і було допитано понад 200 свідків. Крім того, було прослухано 150 000 записаних телефонних розмов, зміст яких було коротко викладено і проаналізовано на предмет цінності для розслідування і справжності. У зв'язку з цим понад 3500 з цих прослуханих телефонних розмов було повністю і ретельно зафіксовано, переведено і проаналізовано. Все це оформлено в понад 6000 протоколів.
                         
                         Раніше Рада безпеки Нідерландів уже оголосила результати свого розслідування. Різні розслідування були здійснені також багатьма журналістами і групами дослідників, як, наприклад, "Беллінгкет". При цьому висувалися різні сценарії і теорії, як в засобах масової інформації, так і в мережах Інтернету.
                         
                         Наше кримінальне розслідування направлено на встановлення істини і його остаточна мета – виявлення і кримінальне переслідування винних. Істотна різниця між нашим розслідуванням і журналістським документальним фільмом або ув'язненням розслідування за знайденими в Інтернеті матеріалами, складається в тому, що ми не можемо обмежитися висновками, зробленими на основі ймовірності. Висновки, які спираються на законні і переконливі докази – найважливіше в розслідуванні Об'єднаної слідчої групи. Причому вимоги до доказів високі – ці докази повинні вистояти можливу критику в залі суду. І ми впевнені, що зібрані нами докази виключать будь-які сумніви в причинах катастрофи. Звичайно, останнє слово належить суду. Саме він винесе остаточне рішення.
                         
                         За минулий період ми змогли зібрати стільки доказів, – як було вже заявлено раніше, - щоб могли дати відповідь на запитання про використаний вид зброї, але що ще більш важливо, про те, де конкретно ця зброя була використана. Розслідування з виявлення винних потребує великих зусиль і додаткового часу.
                         
                         Зазвичай ми з великою стриманістю ставимося до заяв про результати ще не завішених розслідувань; результати розслідування видаються тільки в залі суду. Однак ця справа торкнулося весь світ так глибоко, що ми шукали можливості представити вам результати кримінального розслідування вже в більш ранній стадії. Ми ще не можемо і не маємо наміру розповісти все; інакше ми ризикуємо зіграти на руку злочинцям. Крім того, суд надає великого значення таємниці інформації. Тому те, що ми сьогодні розповімо, обмежене існуючими рамками. Ми також не покажемо весь наявний у нас обсяг доказів. Ми зробили підбірку, яка ілюструє хід наших умовиводів і висновків.
                         
                         • Перш за все, ми зупинимося на різних версіях, які ми досліджували, і на висновках, зроблених нами в зв'язку з цими версіями.
                         
                         • Після цього ми перейдемо до результатів розслідування, зокрема щодо використаного зброї та місця запуску.
                         
                         • В кінці ми приділимо належну увагу продовженню розслідування, спрямованого на пошук винних.
                         
                         Ця презентація допоможе зрозуміти, в якій фазі перебуває розслідування. Крім цього, ми готові заявити про те, що ми змогли зібрати більш ніж достатню кількість доказів і доказів, щоб скласти досьє, в якому чітко, не залишаючи місця сумнівам, буде розкрита причина катастрофи.
                         
                         I Дослідження різних версій
                         
                         Об'єднана слідча група (JIT) провела максимально широке розслідування, досліджуючи ряд версій. Ми надавали великого значення розслідуванню цих версій, незважаючи на те, що вже досить швидко після початку розслідування одна з них представлялася найбільш вірогідною. Адже розслідування повинно бути неупередженим і об'єктивним. Не виключено, що в майбутньому в процесі судового розгляду ці версії будуть грати роль, якщо на них, як на можливі альтернативи, будуть посилатися обвинувачені і їх захисники. Прокуратура Нідерландів повинна буде висунути переконливі аргументи на спростування цих альтернатив.
                         
                         Дві з цих версій могли бути виключені вже незабаром, як я вже повідомляв раніше. Цими версіями були нещасний випадок внаслідок технічних причин або людського фактора, і можливість теракту, скоєного особою, яка перебуває всередині авіалайнера. Обидва сценарії були нами досліджені і ми не знайшли нічого, що вказує в даних напрямках. Рада безпеки Нідерландів (OVV) вже оголосила цей висновок 13 жовтня минулого року.
                         
                         Після цього залишалися ще дві версії.
                         
                         По-перше, можливість того, що авіалайнер рейсу МН17 був збитий іншим літаком, що має певну систему озброєння. Дану версію називають також версія: "повітря - повітря".
                         
                         За минулий період нам вдалося виключити і цю версію – "повітря-повітря".
                         
                         Після цього піде пояснення того, як ми дійшли такого висновку.
                         
                         Якби авіалайнер рейсу МН17 був збитий іншим літальним апаратом, він був би виявлений радіолокаційними системами. Радіолокаційні зображення (РЛЗ) стали приводом для багатьох суперечок і занепокоєння, але ми маємо в своєму розпорядженні достатню кількість РЛЗ, що мають ключове значення. Перебувають у нашому розпорядженні РЛЗ надають достатньо підстав для висновку, що в момент катастрофи, в околицях літака рейсу МН17, поблизу нього не було іншого літального апарату.
                         
                         Розслідування цієї версії викликало необхідність проведення додаткових заходів, серед яких опитування експертів і свідків. Слідчі проаналізували всі зібрані дані і не знайшли доказів того, що інший літальний апарат був поблизу в момент катастрофи. Тому ми виключили версію "повітря-повітря".
                         
                         Друга версія – версія "земля-повітря". Виходячи з неї, авіалайнер рейсу МН17 був збитий ракетою, випущеною із зенітно-ракетної установки "Бук". І саме ця версія, в кінцевому рахунку, відповідає результатам кримінального розслідування.
                         
                         II Результати розслідування
                         
                         Почнемо з використаного зброї. Виходячи з численних даних, зокрема отриманих під час розслідування уламків літака, було встановлено, що авіалайнер рейсу МН17 був збитий ракетою серії 9М38, випущеної із зенітно-ракетної установки "Бук". Цей тип ракет містить вибухівку, яка після вибуху розпадається на тисячі частинок, що і викликає руйнування цілі. В результаті загинули всі 298 осіб, що знаходилися на борту авіалайнера.
                         
                         На підставі зібраних даних ми також встановили місце, звідки була випущена ракета. Місцем запуску стала територія, що знаходиться під контролем проросійських бойовиків.
                         
                         Для встановлення точного місця запуску нами було досліджено кілька сотень квадратних кілометрів у східній частині України. Ми встановили, що місце запуску знаходиться неподалік від селища Первомайське. Це була точка координат 48°7'23" північної широти і 38°33'19" східної довготи.
                         
                         Результати розслідування місця запуску підтверджуються численними свідками, а також фотографіями і відеоматеріалами. Свідки розповіли, що в момент катастрофи бачили вогняний стовп, який залишила ракета після запуску. Свідки також розповіли, що чули гучний вибух і бачили дим від ракети. Деякі з них навіть змогли зняти ці моменти на відео, яке потім стало доказом у розслідуванні.
                         
                         Таким чином, ми маємо чіткі докази того, що авіалайнер рейсу МН17 був збитий ракетою, випущеною з установки "Бук", з території, що знаходиться під контролем проросійських бойовиків.
                         
                         III Подальші кроки
                         
                         Ми продовжимо наше розслідування, щоб встановити всіх винних у цій катастрофі. Ми працюємо над ідентифікацією тих, хто віддав наказ про запуск ракети, а також тих, хто безпосередньо його виконував. Ми також зосереджені на встановленні всіх обставин, що сприяли цій катастрофі.
                         
                         Ми закликаємо всіх, хто володіє будь-якою інформацією про цю трагедію, звернутися до нас. Ваша інформація може бути вирішальною для встановлення істини і справедливості.
                         
                         Дякую за вашу увагу.
                         """;
    public double Capacity;
    public ILanguagePack LanguagePack = new UkrainianLanguagePack();
    
    
    [Benchmark]
    public string LuhnSummarize() => Luhn.Summarize(Text, Capacity, LanguagePack);
    [Benchmark]
    public string TextRankSummarize() => TextRank.Summarize(Text, Capacity, LanguagePack);
    [Benchmark]
    public string LexRankSummarize() => LexRank.Summarize(Text, Capacity, LanguagePack);
    [Benchmark]
    public string LsaSummarize() => Lsa.Summarize(Text, Capacity, LanguagePack);
}